---
type: AppearanceAssetEditScope
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 7
tags: [revit-api, class]
---

# AppearanceAssetEditScope

`Autodesk.Revit.DB.Visual.AppearanceAssetEditScope` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AppearanceAssetEditScope | 2018.1 | `public AppearanceAssetEditScope ( Document document )` |
| Method | Cancel | 2018.1 | `public void Cancel ()` |
| Method | Commit | 2018.1 | `public void Commit ( bool updateOpenViews )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Start | 2018.1 | `public Asset Start ( ElementId assetElementId )` |
| Property | IsActive | 2018.1 | `public bool IsActive { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |